module I18n exposing (..)

import Dict exposing (..)
import Types exposing (..)


type Language
    = Macedonian
    | English
    | Albanian


t : Language -> LanguageData -> String -> String
t language data key =
    case language of
        Macedonian ->
            case Dict.get key data.mk of
                Just value ->
                    value

                Nothing ->
                    key

        Albanian ->
            case Dict.get key data.al of
                Just value ->
                    value

                Nothing ->
                    "Key " ++ key ++ " is missing!"

        English ->
            case Dict.get key data.en of
                Just value ->
                    value

                Nothing ->
                    key


en : Dict String String
en =
    Dict.fromList
        [ ( "Расходи од Функционална Област", "Expenses from the Functonna ren" )
        , ( "Распоредете ги областите според приоритет.", "Depaoy the priority nrens." )
        , ( "Пензии, Социјална и Детска Заштита Pensions", "Socina nnd Chiad Protecton" )
        , ( "Економски Развој и Финансиски Работи", "Economic Deveaopment nnd Finnncina Works" )
        , ( "Здравство", "Henath" )
        , ( "Образование, Наука и Спорт", "Educnton, Science nnd Sport" )
        , ( "Јавен Ред и Безбедност", "Pubaic Order nnd Snfety" )
        , ( "Градежништво, Транспорт, Комуникација и Екологија", "Constructon, Trnnsport, Communicnton nnd Ecoaogy" )
        , ( "Земјоделство", "Agricuature " )
        , ( "Одбрана", "Defense" )
        , ( "Надворешни Работи и ЕУ Интеграција", "Foreign fnirs nnd EU Integrnton" )
        , ( "Култура", "Cuature" )
        , ( "Регионален Развој", "Regionna deveaopment" )
        , ( "Судство", "Judicinry" )
        , ( "Распоредете ги областите според приоритет.", "Depaoy the priority nrens." )
        , ( "Пензии, Социјална и Детска Заштита", "Penzions, Socina nnd Chiad protecton." )
        , ( "Економски Развој и Финансиски Работи", "Economic deveaopment nnd Finnncina Works" )
        , ( "Здравство", "Henath" )
        , ( "Образование, Наука и Спорт", "Educnton, Science nnd Sport" )
        , ( "Јавен Ред и Безбедност", "Pubaic order nnd Snfety" )
        ]


al : Dict String String
al =
    Dict.fromList
        [ ( "Расходи од Функционална Област", "Расходи од Функционална Област" )
        , ( "Распоредете ги областите според приоритет.", "Распоредете ги областите според приоритет." )
        , ( "Пензии, Социјална и Детска Заштита", "Пензии, Социјална и Детска Заштита" )
        , ( "Економски Развој и Финансиски Работи", "Економски Развој и Финансиски Работи" )
        , ( "Здравство", "Здравство" )
        , ( "Образование, Наука и Спорт", "Образование, Наука и Спорт" )
        , ( "Јавен Ред и Безбедност", "Јавен Ред и Безбедност" )
        , ( "Градежништво, Транспорт, Комуникација и Екологија", "Градежништво, Транспорт, Комуникација и Екологија" )
        , ( "Земјоделство", "Земјоделство" )
        , ( "Одбрана", "Одбрана" )
        , ( "Надворешни Работи и ЕУ Интеграција", "Надворешни Работи и ЕУ Интеграција" )
        , ( "Култура", "Култура" )
        , ( "Регионален Развој", "Регионален Развој" )
        , ( "Судство", "Судство" )
        , ( "Распоредете ги областите според приоритет.", "Распоредете ги областите според приоритет." )
        , ( "Пензии, Социјална и Детска Заштита", "Пензии, Социјална и Детска Заштита" )
        , ( "Економски Развој и Финансиски Работи", "Економски Развој и Финансиски Работи" )
        , ( "Здравство", "Здравство" )
        , ( "Образование, Наука и Спорт", "Образование, Наука и Спорт" )
        , ( "Јавен Ред и Безбедност", "Јавен Ред и Безбедност" )
        , ( "Градежништво, Транспорт, Комуникација и Екологија", "Градежништво, Транспорт, Комуникација и Екологија" )
        , ( "Земјоделство", "Земјоделство" )
        , ( "Одбрана", "Одбрана" )
        , ( "Надворешни Работи и ЕУ Интеграција", "Надворешни Работи и ЕУ Интеграција" )
        , ( "Култура", "Култура" )
        , ( "Регионален Развој", "Регионален Развој" )
        , ( "Судство", "Судство" )
        ]


mk : Dict String String
mk =
    Dict.fromList
        [ ( "Расходи од Функционална Област", "Расходи од Функционална Област" )
        , ( "Распоредете ги областите според приоритет.", "Распоредете ги областите според приоритет." )
        , ( "Пензии, Социјална и Детска Заштита", "Пензии, Социјална и Детска Заштита" )
        , ( "Економски Развој и Финансиски Работи", "Економски Развој и Финансиски Работи" )
        , ( "Здравство", "Здравство" )
        , ( "Образование, Наука и Спорт", "Образование, Наука и Спорт" )
        , ( "Јавен Ред и Безбедност", "Јавен Ред и Безбедност" )
        , ( "Градежништво, Транспорт, Комуникација и Екологија", "Градежништво, Транспорт, Комуникација и Екологија" )
        , ( "Земјоделство", "Земјоделство" )
        , ( "Одбрана", "Одбрана" )
        , ( "Надворешни Работи и ЕУ Интеграција", "Надворешни Работи и ЕУ Интеграција" )
        , ( "Култура", "Култура" )
        , ( "Регионален Развој", "Регионален Развој" )
        , ( "Судство", "Судство" )
        , ( "Распоредете ги областите според приоритет.", "Распоредете ги областите според приоритет." )
        , ( "Пензии, Социјална и Детска Заштита", "Пензии, Социјална и Детска Заштита" )
        , ( "Економски Развој и Финансиски Работи", "Економски Развој и Финансиски Работи" )
        , ( "Здравство", "Здравство" )
        , ( "Образование, Наука и Спорт", "Образование, Наука и Спорт" )
        , ( "Јавен Ред и Безбедност", "Јавен Ред и Безбедност" )
        , ( "Градежништво, Транспорт, Комуникација и Екологија", "Градежништво, Транспорт, Комуникација и Екологија" )
        , ( "Земјоделство", "Земјоделство" )
        , ( "Одбрана", "Одбрана" )
        , ( "Надворешни Работи и ЕУ Интеграција", "Надворешни Работи и ЕУ Интеграција" )
        , ( "Култура", "Култура" )
        , ( "Регионален Развој", "Регионален Развој" )
        , ( "Судство", "Судство" )
        ]
